STMicroelectronics/stm32u5xx-hal-driver/Inc/stm32u5xx_ll_fdcan.h
/**
  ******************************************************************************
  * @file    stm32u5xx_ll_fdcan.h
  * @author  MCD Application Team
  * @brief   Header file of FDCAN LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef STM32U5xx_LL_FDCAN_H
#define STM32U5xx_LL_FDCAN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

#if defined(FDCAN1)

/** @defgroup FDCAN_LL FDCAN
  * @{
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup FDCAN_LL_Private_Macros FDCAN Private Macros
  * @{
  */
#define IS_LL_FDCAN_ALL_INSTANCE(__INSTANCE__) IS_FDCAN_ALL_INSTANCE(__INSTANCE__)
/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup FDCAN_LL_Exported_Types FDCAN Exported Types
  * @{
  */

/**
  * @brief  FDCAN init structure definition
  */
typedef struct {
    uint32_t ClockDivider; /*!< Specifies the FDCAN kernel clock divider.
                                       This parameter can be a value of @ref FDCAN_LL_EC_CLOCK_DIVIDER.

                                       This feature can be modified afterwards using unitary function
                                       @ref LL_FDCAN_SetClockDivider(). */

    uint32_t FrameFormat; /*!< Specifies the FDCAN frame format.
                                       This parameter can be a value of @ref FDCAN_LL_EC_FRAME_FORMAT.

                                       This feature can be modified afterwards using unitary function
                                       @ref LL_FDCAN_SetFrameFormat(). */

    uint32_t Mode; /*!< Specifies the FDCAN operating mode.
                                       This parameter can be a value of @ref FDCAN_LL_EC_MODE.

                                       This feature can be modified afterwards using unitary function
                                       @ref LL_FDCAN_SetMode(). */

    uint32_t AutoRetransmission; /*!< Specifies whether automatic retransmission is enabled.
                                       This parameter can be a value of @ref FDCAN_LL_EC_AUTO_RETRANSMISSION.

                                       This feature can be modified afterwards using unitary functions
                                       @ref LL_FDCAN_EnableAutoRetransmission() and
                                       @ref LL_FDCAN_DisableAutoRetransmission(). */

    uint32_t TransmitPause; /*!< Specifies whether transmit pause is enabled.
                                       This parameter can be a value of @ref FDCAN_LL_EC_TRANSMIT_PAUSE.

                                       This feature can be modified afterwards using unitary functions
                                       @ref LL_FDCAN_EnableTransmitPause() and @ref LL_FDCAN_DisableTransmitPause(). */

    uint32_t ProtocolException; /*!< Specifies whether protocol exception handling is enabled.
                                       This parameter can be a value of @ref FDCAN_LL_EC_PROTOCOL_EXCEPTION.

                                       This feature can be modified afterwards using unitary functions
                                       @ref LL_FDCAN_EnableProtocolException() and
                                       @ref LL_FDCAN_DisableProtocolException(). */

    uint32_t NominalPrescaler; /*!< Specifies the nominal bit time prescaler.
                                       This parameter must be a number between 1 and 512. */

    uint32_t NominalSyncJumpWidth; /*!< Specifies the nominal sync jump width.
                                       This parameter must be a number between 1 and 128. */

    uint32_t NominalTimeSeg1; /*!< Specifies nominal bit segment 1.
                                       This parameter must be a number between 1 and 256. */

    uint32_t NominalTimeSeg2; /*!< Specifies nominal bit segment 2.
                                       This parameter must be a number between 1 and 128. */

    uint32_t DataPrescaler; /*!< Specifies the data bit time prescaler.
                                       This parameter must be a number between 1 and 32. */

    uint32_t DataSyncJumpWidth; /*!< Specifies the data sync jump width.
                                       This parameter must be a number between 1 and 16. */

    uint32_t DataTimeSeg1; /*!< Specifies data bit segment 1.
                                       This parameter must be a number between 1 and 32. */

    uint32_t DataTimeSeg2; /*!< Specifies data bit segment 2.
                                       This parameter must be a number between 1 and 16. */

    uint32_t StdFiltersNbr; /*!< Specifies the number of standard filters.
                                       This parameter must be a number between 0 and LL_FDCAN_MAX_STD_FILTERS. */

    uint32_t ExtFiltersNbr; /*!< Specifies the number of extended filters.
                                       This parameter must be a number between 0 and LL_FDCAN_MAX_EXT_FILTERS. */

    uint32_t TxFifoQueueMode; /*!< Specifies Tx FIFO/Queue mode.
                                       This parameter can be a value of @ref FDCAN_LL_EC_TX_FIFO_QUEUE_MODE.

                                       This feature can be modified afterwards using unitary function
                                       @ref LL_FDCAN_SetTxFifoQueueMode(). */
} LL_FDCAN_InitTypeDef;

/**
  * @brief  FDCAN message RAM block addresses definition
  */
typedef struct {
    uint32_t StandardFilterSA; /*!< Standard filter list start address */
    uint32_t ExtendedFilterSA; /*!< Extended filter list start address */
    uint32_t RxFIFO0SA; /*!< Rx FIFO 0 start address            */
    uint32_t RxFIFO1SA; /*!< Rx FIFO 1 start address            */
    uint32_t TxEventFIFOSA; /*!< Tx event FIFO start address        */
    uint32_t TxFIFOQSA; /*!< Tx FIFO/Queue start address        */
} LL_FDCAN_MessageRAMTypeDef;

/**
  * @brief  FDCAN filter structure definition
  */
typedef struct {
    uint32_t IdType; /*!< Specifies the identifier type.
                              This parameter can be a value of @ref FDCAN_LL_EC_ID_TYPE. */
    uint32_t FilterIndex; /*!< Specifies the filter index. */
    uint32_t FilterType; /*!< Specifies the filter type.
                              This parameter can be a value of @ref FDCAN_LL_EC_FILTER_TYPE. */
    uint32_t FilterConfig; /*!< Specifies the filter configuration.
                              This parameter can be a value of @ref FDCAN_LL_EC_FILTER_CONFIG. */
    uint32_t FilterID1; /*!< Specifies filter identification 1. */
    uint32_t FilterID2; /*!< Specifies filter identification 2. */
} LL_FDCAN_FilterTypeDef;

/**
  * @brief  FDCAN Tx header structure definition
  */
typedef struct {
    uint32_t Identifier; /*!< Specifies the identifier. */
    uint32_t IdType; /*!< Specifies the identifier type.
                                     This parameter can be a value of @ref FDCAN_LL_EC_ID_TYPE. */
    uint32_t TxFrameType; /*!< Specifies the frame type.
                                     This parameter can be a value of @ref FDCAN_LL_EC_FRAME_TYPE. */
    uint32_t DataLength; /*!< Specifies the frame data length code.
                                     This parameter can be a value of @ref FDCAN_LL_EC_DATA_LENGTH. */
    uint32_t ErrorStateIndicator; /*!< Specifies the error state indicator.
                                     This parameter can be a value of @ref FDCAN_LL_EC_ERROR_STATE_INDICATOR. */
    uint32_t BitRateSwitch; /*!< Specifies whether bit rate switching is used.
                                     This parameter can be a value of @ref FDCAN_LL_EC_BIT_RATE_SWITCH. */
    uint32_t FDFormat; /*!< Specifies Classic CAN or FD CAN format.
                                     This parameter can be a value of @ref FDCAN_LL_EC_FD_FORMAT. */
    uint32_t TxEventFifoControl; /*!< Specifies Tx event FIFO control.
                                     This parameter can be a value of @ref FDCAN_LL_EC_TX_EVENT_FIFO_CONTROL. */
    uint32_t MessageMarker; /*!< Specifies the message marker. */
} LL_FDCAN_TxHeaderTypeDef;

/**
  * @brief  FDCAN Rx header structure definition
  */
typedef struct {
    uint32_t Identifier; /*!< Specifies the identifier. */
    uint32_t IdType; /*!< Specifies the identifier type.
                                       This parameter can be a value of @ref FDCAN_LL_EC_ID_TYPE. */
    uint32_t RxFrameType; /*!< Specifies the frame type.
                                       This parameter can be a value of @ref FDCAN_LL_EC_FRAME_TYPE. */
    uint32_t DataLength; /*!< Specifies the frame data length code.
                                       This parameter can be a value of @ref FDCAN_LL_EC_DATA_LENGTH. */
    uint32_t ErrorStateIndicator; /*!< Specifies the error state indicator.
                                       This parameter can be a value of @ref FDCAN_LL_EC_ERROR_STATE_INDICATOR. */
    uint32_t BitRateSwitch; /*!< Specifies whether bit rate switching was used.
                                       This parameter can be a value of @ref FDCAN_LL_EC_BIT_RATE_SWITCH. */
    uint32_t FDFormat; /*!< Specifies Classic CAN or FD CAN format.
                                       This parameter can be a value of @ref FDCAN_LL_EC_FD_FORMAT. */
    uint32_t RxTimestamp; /*!< Specifies the Rx timestamp. */
    uint32_t FilterIndex; /*!< Specifies the matching Rx acceptance filter index. */
    uint32_t
        IsFilterMatchingFrame; /*!< Specifies whether the accepted frame did not match any Rx filter. */
} LL_FDCAN_RxHeaderTypeDef;

/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/* Exported constants --------------------------------------------------------*/
/** @defgroup FDCAN_LL_Exported_Constants FDCAN Exported Constants
  * @{
  */

