STMicroelectronics/stm32u5xx-hal-driver/Inc/stm32u5xx_ll_fdcan.h
#define LL_FDCAN_MAX_STD_FILTERS (28U)
#define LL_FDCAN_MAX_EXT_FILTERS (8U)
#define LL_FDCAN_MAX_RX_FIFO0_ELEMENTS (3U)
#define LL_FDCAN_MAX_RX_FIFO1_ELEMENTS (3U)
#define LL_FDCAN_MAX_TX_EVENT_FIFO_ELEMENTS (3U)
#define LL_FDCAN_MAX_TX_FIFO_QUEUE_ELEMENTS (3U)
#define LL_FDCAN_MESSAGE_RAM_SIZE (848U)

/** @defgroup FDCAN_LL_EC_GET_FLAG Get Flags Defines
  * @{
  */
#define LL_FDCAN_FLAG_TX_COMPLETE FDCAN_IR_TC
#define LL_FDCAN_FLAG_TX_ABORT_COMPLETE FDCAN_IR_TCF
#define LL_FDCAN_FLAG_TX_FIFO_EMPTY FDCAN_IR_TFE
#define LL_FDCAN_FLAG_RX_HIGH_PRIORITY_MSG FDCAN_IR_HPM
#define LL_FDCAN_FLAG_TX_EVT_FIFO_ELT_LOST FDCAN_IR_TEFL
#define LL_FDCAN_FLAG_TX_EVT_FIFO_FULL FDCAN_IR_TEFF
#define LL_FDCAN_FLAG_TX_EVT_FIFO_NEW_DATA FDCAN_IR_TEFN
#define LL_FDCAN_FLAG_RX_FIFO0_MESSAGE_LOST FDCAN_IR_RF0L
#define LL_FDCAN_FLAG_RX_FIFO0_FULL FDCAN_IR_RF0F
#define LL_FDCAN_FLAG_RX_FIFO0_NEW_MESSAGE FDCAN_IR_RF0N
#define LL_FDCAN_FLAG_RX_FIFO1_MESSAGE_LOST FDCAN_IR_RF1L
#define LL_FDCAN_FLAG_RX_FIFO1_FULL FDCAN_IR_RF1F
#define LL_FDCAN_FLAG_RX_FIFO1_NEW_MESSAGE FDCAN_IR_RF1N
#define LL_FDCAN_FLAG_RAM_ACCESS_FAILURE FDCAN_IR_MRAF
#define LL_FDCAN_FLAG_ERROR_LOGGING_OVERFLOW FDCAN_IR_ELO
#define LL_FDCAN_FLAG_ERROR_PASSIVE FDCAN_IR_EP
#define LL_FDCAN_FLAG_ERROR_WARNING FDCAN_IR_EW
#define LL_FDCAN_FLAG_BUS_OFF FDCAN_IR_BO
#define LL_FDCAN_FLAG_RAM_WATCHDOG FDCAN_IR_WDI
#define LL_FDCAN_FLAG_ARB_PROTOCOL_ERROR FDCAN_IR_PEA
#define LL_FDCAN_FLAG_DATA_PROTOCOL_ERROR FDCAN_IR_PED
#define LL_FDCAN_FLAG_RESERVED_ADDRESS_ACCESS FDCAN_IR_ARA
#define LL_FDCAN_FLAG_TIMESTAMP_WRAPAROUND FDCAN_IR_TSW
#define LL_FDCAN_FLAG_TIMEOUT_OCCURRED FDCAN_IR_TOO
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_IT IT Defines
  * @{
  */
#define LL_FDCAN_IT_TX_COMPLETE FDCAN_IE_TCE
#define LL_FDCAN_IT_TX_ABORT_COMPLETE FDCAN_IE_TCFE
#define LL_FDCAN_IT_TX_FIFO_EMPTY FDCAN_IE_TFEE
#define LL_FDCAN_IT_RX_HIGH_PRIORITY_MSG FDCAN_IE_HPME
#define LL_FDCAN_IT_TX_EVT_FIFO_ELT_LOST FDCAN_IE_TEFLE
#define LL_FDCAN_IT_TX_EVT_FIFO_FULL FDCAN_IE_TEFFE
#define LL_FDCAN_IT_TX_EVT_FIFO_NEW_DATA FDCAN_IE_TEFNE
#define LL_FDCAN_IT_RX_FIFO0_MESSAGE_LOST FDCAN_IE_RF0LE
#define LL_FDCAN_IT_RX_FIFO0_FULL FDCAN_IE_RF0FE
#define LL_FDCAN_IT_RX_FIFO0_NEW_MESSAGE FDCAN_IE_RF0NE
#define LL_FDCAN_IT_RX_FIFO1_MESSAGE_LOST FDCAN_IE_RF1LE
#define LL_FDCAN_IT_RX_FIFO1_FULL FDCAN_IE_RF1FE
#define LL_FDCAN_IT_RX_FIFO1_NEW_MESSAGE FDCAN_IE_RF1NE
#define LL_FDCAN_IT_TIMESTAMP_WRAPAROUND FDCAN_IE_TSWE
#define LL_FDCAN_IT_RAM_ACCESS_FAILURE FDCAN_IE_MRAFE
#define LL_FDCAN_IT_TIMEOUT_OCCURRED FDCAN_IE_TOOE
#define LL_FDCAN_IT_ERROR_LOGGING_OVERFLOW FDCAN_IE_ELOE
#define LL_FDCAN_IT_ERROR_PASSIVE FDCAN_IE_EPE
#define LL_FDCAN_IT_ERROR_WARNING FDCAN_IE_EWE
#define LL_FDCAN_IT_BUS_OFF FDCAN_IE_BOE
#define LL_FDCAN_IT_RAM_WATCHDOG FDCAN_IE_WDIE
#define LL_FDCAN_IT_ARB_PROTOCOL_ERROR FDCAN_IE_PEAE
#define LL_FDCAN_IT_DATA_PROTOCOL_ERROR FDCAN_IE_PEDE
#define LL_FDCAN_IT_RESERVED_ADDRESS_ACCESS FDCAN_IE_ARAE
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_INTERRUPT_LINE Interrupt Lines
  * @{
  */
#define LL_FDCAN_INTERRUPT_LINE0 FDCAN_ILE_EINT0
#define LL_FDCAN_INTERRUPT_LINE1 FDCAN_ILE_EINT1
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_IT_GROUP Interrupt Groups
  * @{
  */
#define LL_FDCAN_IT_GROUP_RX_FIFO0 FDCAN_ILS_RXFIFO0
#define LL_FDCAN_IT_GROUP_RX_FIFO1 FDCAN_ILS_RXFIFO1
#define LL_FDCAN_IT_GROUP_STATUS_MESSAGE FDCAN_ILS_SMSG
#define LL_FDCAN_IT_GROUP_TX_FIFO_ERROR FDCAN_ILS_TFERR
#define LL_FDCAN_IT_GROUP_MISC FDCAN_ILS_MISC
#define LL_FDCAN_IT_GROUP_BIT_LINE_ERROR FDCAN_ILS_BERR
#define LL_FDCAN_IT_GROUP_PROTOCOL_ERROR FDCAN_ILS_PERR
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_FRAME_FORMAT Frame Format
  * @{
  */
#define LL_FDCAN_FRAME_CLASSIC (0x00000000UL)
#define LL_FDCAN_FRAME_FD_NO_BRS FDCAN_CCCR_FDOE
#define LL_FDCAN_FRAME_FD_BRS (FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_MODE Operating Mode
  * @{
  */
#define LL_FDCAN_MODE_NORMAL (0x00000000UL)
#define LL_FDCAN_MODE_RESTRICTED_OPERATION (0x00000001UL)
#define LL_FDCAN_MODE_BUS_MONITORING (0x00000002UL)
#define LL_FDCAN_MODE_INTERNAL_LOOPBACK (0x00000003UL)
#define LL_FDCAN_MODE_EXTERNAL_LOOPBACK (0x00000004UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_CLOCK_DIVIDER Clock Divider
  * @{
  */
#define LL_FDCAN_CLOCK_DIV1 (0x00000000UL)
#define LL_FDCAN_CLOCK_DIV2 (0x00000001UL)
#define LL_FDCAN_CLOCK_DIV4 (0x00000002UL)
#define LL_FDCAN_CLOCK_DIV6 (0x00000003UL)
#define LL_FDCAN_CLOCK_DIV8 (0x00000004UL)
#define LL_FDCAN_CLOCK_DIV10 (0x00000005UL)
#define LL_FDCAN_CLOCK_DIV12 (0x00000006UL)
#define LL_FDCAN_CLOCK_DIV14 (0x00000007UL)
#define LL_FDCAN_CLOCK_DIV16 (0x00000008UL)
#define LL_FDCAN_CLOCK_DIV18 (0x00000009UL)
#define LL_FDCAN_CLOCK_DIV20 (0x0000000AUL)
#define LL_FDCAN_CLOCK_DIV22 (0x0000000BUL)
#define LL_FDCAN_CLOCK_DIV24 (0x0000000CUL)
#define LL_FDCAN_CLOCK_DIV26 (0x0000000DUL)
#define LL_FDCAN_CLOCK_DIV28 (0x0000000EUL)
#define LL_FDCAN_CLOCK_DIV30 (0x0000000FUL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_AUTO_RETRANSMISSION Auto Retransmission
  * @{
  */
#define LL_FDCAN_AUTO_RETRANSMISSION_ENABLE (0x00000000UL)
#define LL_FDCAN_AUTO_RETRANSMISSION_DISABLE FDCAN_CCCR_DAR
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_TRANSMIT_PAUSE Transmit Pause
  * @{
  */
#define LL_FDCAN_TRANSMIT_PAUSE_DISABLE (0x00000000UL)
#define LL_FDCAN_TRANSMIT_PAUSE_ENABLE FDCAN_CCCR_TXP
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_PROTOCOL_EXCEPTION Protocol Exception
  * @{
  */
#define LL_FDCAN_PROTOCOL_EXCEPTION_ENABLE (0x00000000UL)
#define LL_FDCAN_PROTOCOL_EXCEPTION_DISABLE FDCAN_CCCR_PXHD
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_TX_FIFO_QUEUE_MODE Tx FIFO/Queue Mode
  * @{
  */
#define LL_FDCAN_TX_FIFO_OPERATION (0x00000000UL)
#define LL_FDCAN_TX_QUEUE_OPERATION FDCAN_TXBC_TFQM
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_ID_TYPE Identifier Type
  * @{
  */
#define LL_FDCAN_STANDARD_ID (0x00000000UL)
#define LL_FDCAN_EXTENDED_ID (0x40000000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_FRAME_TYPE Frame Type
  * @{
  */
#define LL_FDCAN_DATA_FRAME (0x00000000UL)
#define LL_FDCAN_REMOTE_FRAME (0x20000000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_DATA_LENGTH Data Length Code
  * @{
  */
#define LL_FDCAN_DLC_BYTES_0 (0x00000000UL)
#define LL_FDCAN_DLC_BYTES_1 (0x00000001UL)
#define LL_FDCAN_DLC_BYTES_2 (0x00000002UL)
#define LL_FDCAN_DLC_BYTES_3 (0x00000003UL)
#define LL_FDCAN_DLC_BYTES_4 (0x00000004UL)
#define LL_FDCAN_DLC_BYTES_5 (0x00000005UL)
#define LL_FDCAN_DLC_BYTES_6 (0x00000006UL)
#define LL_FDCAN_DLC_BYTES_7 (0x00000007UL)
#define LL_FDCAN_DLC_BYTES_8 (0x00000008UL)
#define LL_FDCAN_DLC_BYTES_12 (0x00000009UL)
#define LL_FDCAN_DLC_BYTES_16 (0x0000000AUL)
#define LL_FDCAN_DLC_BYTES_20 (0x0000000BUL)
#define LL_FDCAN_DLC_BYTES_24 (0x0000000CUL)
#define LL_FDCAN_DLC_BYTES_32 (0x0000000DUL)
#define LL_FDCAN_DLC_BYTES_48 (0x0000000EUL)
#define LL_FDCAN_DLC_BYTES_64 (0x0000000FUL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_ERROR_STATE_INDICATOR Error State Indicator
  * @{
  */
#define LL_FDCAN_ESI_ACTIVE (0x00000000UL)
#define LL_FDCAN_ESI_PASSIVE (0x80000000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_BIT_RATE_SWITCH Bit Rate Switching
  * @{
  */
#define LL_FDCAN_BRS_OFF (0x00000000UL)
#define LL_FDCAN_BRS_ON (0x00100000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_FD_FORMAT FD Format
  * @{
  */
#define LL_FDCAN_CLASSIC_CAN (0x00000000UL)
#define LL_FDCAN_FD_CAN (0x00200000UL)
/**
  * @}
  */

