STMicroelectronics/stm32u5xx-hal-driver/Inc/stm32u5xx_ll_fdcan.h
/** @defgroup FDCAN_LL_EC_TX_EVENT_FIFO_CONTROL Tx Event FIFO Control
  * @{
  */
#define LL_FDCAN_NO_TX_EVENTS (0x00000000UL)
#define LL_FDCAN_STORE_TX_EVENTS (0x00800000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_FILTER_TYPE Filter Type
  * @{
  */
#define LL_FDCAN_FILTER_RANGE (0x00000000UL)
#define LL_FDCAN_FILTER_DUAL (0x00000001UL)
#define LL_FDCAN_FILTER_MASK (0x00000002UL)
#define LL_FDCAN_FILTER_RANGE_NO_EIDM (0x00000003UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_FILTER_CONFIG Filter Config
  * @{
  */
#define LL_FDCAN_FILTER_DISABLE (0x00000000UL)
#define LL_FDCAN_FILTER_TO_RXFIFO0 (0x00000001UL)
#define LL_FDCAN_FILTER_TO_RXFIFO1 (0x00000002UL)
#define LL_FDCAN_FILTER_REJECT (0x00000003UL)
#define LL_FDCAN_FILTER_HP (0x00000004UL)
#define LL_FDCAN_FILTER_TO_RXFIFO0_HP (0x00000005UL)
#define LL_FDCAN_FILTER_TO_RXFIFO1_HP (0x00000006UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_RX_FIFO Rx FIFO
  * @{
  */
#define LL_FDCAN_RX_FIFO0 (0x00000040UL)
#define LL_FDCAN_RX_FIFO1 (0x00000041UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_RX_FIFO_MODE Rx FIFO Mode
  * @{
  */
#define LL_FDCAN_RX_FIFO_BLOCKING (0x00000000UL)
#define LL_FDCAN_RX_FIFO_OVERWRITE (0x00000001UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_TIMESTAMP Timestamp
  * @{
  */
#define LL_FDCAN_TIMESTAMP_INTERNAL (0x00000001UL)
#define LL_FDCAN_TIMESTAMP_EXTERNAL (0x00000002UL)
#define LL_FDCAN_TIMESTAMP_PRESC_1 (0x00000000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_2 (0x00010000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_3 (0x00020000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_4 (0x00030000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_5 (0x00040000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_6 (0x00050000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_7 (0x00060000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_8 (0x00070000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_9 (0x00080000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_10 (0x00090000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_11 (0x000A0000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_12 (0x000B0000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_13 (0x000C0000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_14 (0x000D0000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_15 (0x000E0000UL)
#define LL_FDCAN_TIMESTAMP_PRESC_16 (0x000F0000UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_TIMEOUT Timeout
  * @{
  */
#define LL_FDCAN_TIMEOUT_CONTINUOUS (0x00000000UL)
#define LL_FDCAN_TIMEOUT_TX_EVENT_FIFO (0x00000002UL)
#define LL_FDCAN_TIMEOUT_RX_FIFO0 (0x00000004UL)
#define LL_FDCAN_TIMEOUT_RX_FIFO1 (0x00000006UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_PROTOCOL_STATUS Protocol Status
  * @{
  */
#define LL_FDCAN_PROTOCOL_ERROR_NONE (0x00000000UL)
#define LL_FDCAN_PROTOCOL_ERROR_STUFF (0x00000001UL)
#define LL_FDCAN_PROTOCOL_ERROR_FORM (0x00000002UL)
#define LL_FDCAN_PROTOCOL_ERROR_ACK (0x00000003UL)
#define LL_FDCAN_PROTOCOL_ERROR_BIT1 (0x00000004UL)
#define LL_FDCAN_PROTOCOL_ERROR_BIT0 (0x00000005UL)
#define LL_FDCAN_PROTOCOL_ERROR_CRC (0x00000006UL)
#define LL_FDCAN_PROTOCOL_ERROR_NO_CHANGE (0x00000007UL)
#define LL_FDCAN_COM_STATE_SYNC (0x00000000UL)
#define LL_FDCAN_COM_STATE_IDLE (0x00000008UL)
#define LL_FDCAN_COM_STATE_RX (0x00000010UL)
#define LL_FDCAN_COM_STATE_TX (0x00000018UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_HP_MESSAGE_STATUS High Priority Message Status
  * @{
  */
#define LL_FDCAN_HP_STORAGE_NO_FIFO (0x00000000UL)
#define LL_FDCAN_HP_STORAGE_MSG_LOST (0x00000040UL)
#define LL_FDCAN_HP_STORAGE_RXFIFO0 (0x00000080UL)
#define LL_FDCAN_HP_STORAGE_RXFIFO1 (0x000000C0UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_NON_MATCHING_FRAMES Non Matching Frames
  * @{
  */
#define LL_FDCAN_ACCEPT_IN_RX_FIFO0 (0x00000000UL)
#define LL_FDCAN_ACCEPT_IN_RX_FIFO1 (0x00000001UL)
#define LL_FDCAN_REJECT (0x00000002UL)
/**
  * @}
  */

/** @defgroup FDCAN_LL_EC_REJECT_REMOTE_FRAMES Reject Remote Frames
  * @{
  */
#define LL_FDCAN_FILTER_REMOTE (0x00000000UL)
#define LL_FDCAN_REJECT_REMOTE (0x00000001UL)
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup FDCAN_LL_Exported_Macros FDCAN Exported Macros
  * @{
  */

/** @brief  Write a value in FDCAN register */
#define LL_FDCAN_WriteReg(__INSTANCE__, __REG__, __VALUE__) \
    WRITE_REG((__INSTANCE__)->__REG__, (__VALUE__))

/** @brief  Read a value in FDCAN register */
#define LL_FDCAN_ReadReg(__INSTANCE__, __REG__) READ_REG((__INSTANCE__)->__REG__)

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup FDCAN_LL_Exported_Functions FDCAN Exported Functions
  * @{
  */

/** @defgroup FDCAN_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Set the FDCAN clock divider.
  * @rmtoll CKDIV        PDIV          LL_FDCAN_SetClockDivider
  * @param  ClockDivider This parameter can be a value of @ref FDCAN_LL_EC_CLOCK_DIVIDER
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetClockDivider(uint32_t ClockDivider) {
    MODIFY_REG(FDCAN_CONFIG->CKDIV, FDCAN_CKDIV_PDIV, ClockDivider);
}

/**
  * @brief  Get the FDCAN clock divider.
  * @rmtoll CKDIV        PDIV          LL_FDCAN_GetClockDivider
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_CLOCK_DIVIDER
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetClockDivider(void) {
    return (uint32_t)(READ_BIT(FDCAN_CONFIG->CKDIV, FDCAN_CKDIV_PDIV));
}

/**
  * @brief  Request initialization mode.
  * @rmtoll CCCR         INIT          LL_FDCAN_RequestInit
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_RequestInit(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_INIT);
}

/**
  * @brief  Request normal operation by leaving initialization mode.
  * @rmtoll CCCR         INIT          LL_FDCAN_RequestOperation
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_RequestOperation(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_INIT);
}

/**
  * @brief  Check if initialization mode is active.
  * @rmtoll CCCR         INIT          LL_FDCAN_IsActiveFlag_INIT
  * @param  FDCANx FDCAN Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FDCAN_IsActiveFlag_INIT(const FDCAN_GlobalTypeDef* FDCANx) {
    return ((READ_BIT(FDCANx->CCCR, FDCAN_CCCR_INIT) == FDCAN_CCCR_INIT) ? 1UL : 0UL);
}

/**
  * @brief  Enable configuration change.
  * @rmtoll CCCR         CCE           LL_FDCAN_EnableConfigurationChange
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableConfigurationChange(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_CCE);
}

/**
  * @brief  Request sleep mode.
  * @rmtoll CCCR         CSR           LL_FDCAN_RequestSleep
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_RequestSleep(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_CSR);
}

/**
  * @brief  Exit sleep mode.
  * @rmtoll CCCR         CSR           LL_FDCAN_ExitSleep
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ExitSleep(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_CSR);
}

/**
  * @brief  Check if sleep acknowledge flag is active.
  * @rmtoll CCCR         CSA           LL_FDCAN_IsActiveFlag_CSA
  * @param  FDCANx FDCAN Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FDCAN_IsActiveFlag_CSA(const FDCAN_GlobalTypeDef* FDCANx) {
    return ((READ_BIT(FDCANx->CCCR, FDCAN_CCCR_CSA) == FDCAN_CCCR_CSA) ? 1UL : 0UL);
}

/**
  * @brief  Set frame format.
  * @rmtoll CCCR         FDOE          LL_FDCAN_SetFrameFormat\n
  *         CCCR         BRSE          LL_FDCAN_SetFrameFormat
  * @param  FDCANx FDCAN Instance
  * @param  FrameFormat This parameter can be a value of @ref FDCAN_LL_EC_FRAME_FORMAT
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetFrameFormat(FDCAN_GlobalTypeDef* FDCANx, uint32_t FrameFormat) {
    MODIFY_REG(FDCANx->CCCR, FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE, FrameFormat);
}

/**
  * @brief  Get frame format.
  * @rmtoll CCCR         FDOE          LL_FDCAN_GetFrameFormat\n
  *         CCCR         BRSE          LL_FDCAN_GetFrameFormat
  * @param  FDCANx FDCAN Instance
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_FRAME_FORMAT
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetFrameFormat(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->CCCR, FDCAN_CCCR_FDOE | FDCAN_CCCR_BRSE));
}

/**
  * @brief  Enable automatic retransmission.
  * @rmtoll CCCR         DAR           LL_FDCAN_EnableAutoRetransmission
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableAutoRetransmission(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_DAR);
}

/**
  * @brief  Disable automatic retransmission.
  * @rmtoll CCCR         DAR           LL_FDCAN_DisableAutoRetransmission
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableAutoRetransmission(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_DAR);
}

/**
  * @brief  Enable transmit pause.
  * @rmtoll CCCR         TXP           LL_FDCAN_EnableTransmitPause
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableTransmitPause(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_TXP);
}

/**
  * @brief  Disable transmit pause.
  * @rmtoll CCCR         TXP           LL_FDCAN_DisableTransmitPause
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableTransmitPause(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_TXP);
}

/**
  * @brief  Enable protocol exception handling.
  * @rmtoll CCCR         PXHD          LL_FDCAN_EnableProtocolException
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableProtocolException(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_PXHD);
}

/**
  * @brief  Disable protocol exception handling.
  * @rmtoll CCCR         PXHD          LL_FDCAN_DisableProtocolException
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableProtocolException(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_PXHD);
}

/**
  * @brief  Set nominal bit timing.
  * @rmtoll NBTP         NSJW          LL_FDCAN_SetNominalBitTiming\n
  *         NBTP         NTSEG1        LL_FDCAN_SetNominalBitTiming\n
  *         NBTP         NTSEG2        LL_FDCAN_SetNominalBitTiming\n
  *         NBTP         NBRP          LL_FDCAN_SetNominalBitTiming
  * @param  FDCANx FDCAN Instance
  * @param  Prescaler Nominal prescaler, from 1 to 512.
  * @param  SyncJumpWidth Nominal sync jump width, from 1 to 128.
  * @param  TimeSeg1 Nominal time segment 1, from 1 to 256.
  * @param  TimeSeg2 Nominal time segment 2, from 1 to 128.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetNominalBitTiming(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t Prescaler,
    uint32_t SyncJumpWidth,
    uint32_t TimeSeg1,
    uint32_t TimeSeg2) {
    WRITE_REG(
        FDCANx->NBTP,
        (((SyncJumpWidth - 1UL) << FDCAN_NBTP_NSJW_Pos) |
         ((TimeSeg1 - 1UL) << FDCAN_NBTP_NTSEG1_Pos) |
         ((TimeSeg2 - 1UL) << FDCAN_NBTP_NTSEG2_Pos) |
         ((Prescaler - 1UL) << FDCAN_NBTP_NBRP_Pos)));
}

/**
  * @brief  Set data bit timing.
  * @rmtoll DBTP         DSJW          LL_FDCAN_SetDataBitTiming\n
  *         DBTP         DTSEG1        LL_FDCAN_SetDataBitTiming\n
  *         DBTP         DTSEG2        LL_FDCAN_SetDataBitTiming\n
  *         DBTP         DBRP          LL_FDCAN_SetDataBitTiming
  * @param  FDCANx FDCAN Instance
  * @param  Prescaler Data prescaler, from 1 to 32.
  * @param  SyncJumpWidth Data sync jump width, from 1 to 16.
  * @param  TimeSeg1 Data time segment 1, from 1 to 32.
  * @param  TimeSeg2 Data time segment 2, from 1 to 16.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetDataBitTiming(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t Prescaler,
    uint32_t SyncJumpWidth,
    uint32_t TimeSeg1,
    uint32_t TimeSeg2) {
    WRITE_REG(
        FDCANx->DBTP,
        (((SyncJumpWidth - 1UL) << FDCAN_DBTP_DSJW_Pos) |
         ((TimeSeg1 - 1UL) << FDCAN_DBTP_DTSEG1_Pos) |
         ((TimeSeg2 - 1UL) << FDCAN_DBTP_DTSEG2_Pos) |
         ((Prescaler - 1UL) << FDCAN_DBTP_DBRP_Pos)));
}

/**
  * @brief  Set Tx FIFO/Queue operation mode.
  * @rmtoll TXBC         TFQM          LL_FDCAN_SetTxFifoQueueMode
  * @param  FDCANx FDCAN Instance
  * @param  TxFifoQueueMode This parameter can be a value of @ref FDCAN_LL_EC_TX_FIFO_QUEUE_MODE
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_SetTxFifoQueueMode(FDCAN_GlobalTypeDef* FDCANx, uint32_t TxFifoQueueMode) {
    MODIFY_REG(FDCANx->TXBC, FDCAN_TXBC_TFQM, TxFifoQueueMode);
}

/**
  * @brief  Configure standard and extended filter list sizes.
  * @rmtoll RXGFC        LSS           LL_FDCAN_SetFilterListSize\n
  *         RXGFC        LSE           LL_FDCAN_SetFilterListSize
  * @param  FDCANx FDCAN Instance
  * @param  StdFiltersNbr Number of standard filters.
  * @param  ExtFiltersNbr Number of extended filters.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetFilterListSize(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t StdFiltersNbr,
    uint32_t ExtFiltersNbr) {
    MODIFY_REG(
        FDCANx->RXGFC,
        FDCAN_RXGFC_LSS | FDCAN_RXGFC_LSE,
        (StdFiltersNbr << FDCAN_RXGFC_LSS_Pos) | (ExtFiltersNbr << FDCAN_RXGFC_LSE_Pos));
}

/**
  * @brief  Configure global filtering.
  * @rmtoll RXGFC        ANFS          LL_FDCAN_ConfigGlobalFilter\n
  *         RXGFC        ANFE          LL_FDCAN_ConfigGlobalFilter\n
  *         RXGFC        RRFS          LL_FDCAN_ConfigGlobalFilter\n
  *         RXGFC        RRFE          LL_FDCAN_ConfigGlobalFilter
  * @param  FDCANx FDCAN Instance
  * @param  NonMatchingStd This parameter can be a value of @ref FDCAN_LL_EC_NON_MATCHING_FRAMES
  * @param  NonMatchingExt This parameter can be a value of @ref FDCAN_LL_EC_NON_MATCHING_FRAMES
  * @param  RejectRemoteStd This parameter can be a value of @ref FDCAN_LL_EC_REJECT_REMOTE_FRAMES
  * @param  RejectRemoteExt This parameter can be a value of @ref FDCAN_LL_EC_REJECT_REMOTE_FRAMES
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ConfigGlobalFilter(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t NonMatchingStd,
    uint32_t NonMatchingExt,
    uint32_t RejectRemoteStd,
    uint32_t RejectRemoteExt) {
    MODIFY_REG(
        FDCANx->RXGFC,
        FDCAN_RXGFC_ANFS | FDCAN_RXGFC_ANFE | FDCAN_RXGFC_RRFS | FDCAN_RXGFC_RRFE,
        (NonMatchingStd << FDCAN_RXGFC_ANFS_Pos) | (NonMatchingExt << FDCAN_RXGFC_ANFE_Pos) |
            (RejectRemoteStd << FDCAN_RXGFC_RRFS_Pos) | (RejectRemoteExt << FDCAN_RXGFC_RRFE_Pos));
}

/**
  * @brief  Set extended ID mask.
  * @rmtoll XIDAM        EIDM          LL_FDCAN_SetExtendedIdMask
  * @param  FDCANx FDCAN Instance
  * @param  Mask Extended ID mask.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_SetExtendedIdMask(FDCAN_GlobalTypeDef* FDCANx, uint32_t Mask) {
    WRITE_REG(FDCANx->XIDAM, Mask);
}

/**
  * @brief  Configure Rx FIFO operation mode.
  * @rmtoll RXGFC        F0OM          LL_FDCAN_SetRxFifoMode\n
  *         RXGFC        F1OM          LL_FDCAN_SetRxFifoMode
  * @param  FDCANx FDCAN Instance
  * @param  RxFifo This parameter can be a value of @ref FDCAN_LL_EC_RX_FIFO
  * @param  OperationMode This parameter can be a value of @ref FDCAN_LL_EC_RX_FIFO_MODE
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_SetRxFifoMode(FDCAN_GlobalTypeDef* FDCANx, uint32_t RxFifo, uint32_t OperationMode) {
    if(RxFifo == LL_FDCAN_RX_FIFO0) {
        MODIFY_REG(FDCANx->RXGFC, FDCAN_RXGFC_F0OM, (OperationMode << FDCAN_RXGFC_F0OM_Pos));
    } else {
        MODIFY_REG(FDCANx->RXGFC, FDCAN_RXGFC_F1OM, (OperationMode << FDCAN_RXGFC_F1OM_Pos));
    }
}

/**
  * @brief  Configure RAM watchdog counter start value.
  * @rmtoll RWD          WDC           LL_FDCAN_SetRAMWatchdogCounter
  * @param  FDCANx FDCAN Instance
  * @param  CounterStartValue Start value from 0x00 to 0xFF. 0 disables the counter.
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_SetRAMWatchdogCounter(FDCAN_GlobalTypeDef* FDCANx, uint32_t CounterStartValue) {
    MODIFY_REG(FDCANx->RWD, FDCAN_RWD_WDC, CounterStartValue);
}

/**
  * @brief  Get RAM watchdog counter value.
  * @rmtoll RWD          WDV           LL_FDCAN_GetRAMWatchdogCounter
  * @param  FDCANx FDCAN Instance
  * @retval RAM watchdog counter value.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetRAMWatchdogCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->RWD, FDCAN_RWD_WDV) >> FDCAN_RWD_WDV_Pos);
}

/**
  * @brief  Configure timestamp counter prescaler.
  * @rmtoll TSCC         TCP           LL_FDCAN_SetTimestampPrescaler
  * @param  FDCANx FDCAN Instance
  * @param  TimestampPrescaler This parameter can be a value of @ref FDCAN_LL_EC_TIMESTAMP
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_SetTimestampPrescaler(FDCAN_GlobalTypeDef* FDCANx, uint32_t TimestampPrescaler) {
    MODIFY_REG(FDCANx->TSCC, FDCAN_TSCC_TCP, TimestampPrescaler);
}

/**
  * @brief  Enable timestamp counter.
  * @rmtoll TSCC         TSS           LL_FDCAN_EnableTimestamp
  * @param  FDCANx FDCAN Instance
  * @param  TimestampOperation This parameter can be a value of @ref FDCAN_LL_EC_TIMESTAMP
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_EnableTimestamp(FDCAN_GlobalTypeDef* FDCANx, uint32_t TimestampOperation) {
    MODIFY_REG(FDCANx->TSCC, FDCAN_TSCC_TSS, TimestampOperation);
}

/**
  * @brief  Disable timestamp counter.
  * @rmtoll TSCC         TSS           LL_FDCAN_DisableTimestamp
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableTimestamp(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->TSCC, FDCAN_TSCC_TSS);
}

/**
  * @brief  Get timestamp counter value.
  * @rmtoll TSCV         TSC           LL_FDCAN_GetTimestampCounter
  * @param  FDCANx FDCAN Instance
  * @retval Timestamp counter value.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTimestampCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->TSCV, FDCAN_TSCV_TSC));
}

/**
  * @brief  Reset timestamp counter value.
  * @rmtoll TSCV         TSC           LL_FDCAN_ResetTimestampCounter
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ResetTimestampCounter(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_REG(FDCANx->TSCV);
}

/**
  * @brief  Configure timeout counter operation and period.
  * @rmtoll TOCC         TOS           LL_FDCAN_ConfigTimeoutCounter\n
  *         TOCC         TOP           LL_FDCAN_ConfigTimeoutCounter
  * @param  FDCANx FDCAN Instance
  * @param  TimeoutOperation This parameter can be a value of @ref FDCAN_LL_EC_TIMEOUT
  * @param  TimeoutPeriod Timeout period from 0x0000 to 0xFFFF.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ConfigTimeoutCounter(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t TimeoutOperation,
    uint32_t TimeoutPeriod) {
    MODIFY_REG(
        FDCANx->TOCC,
        FDCAN_TOCC_TOS | FDCAN_TOCC_TOP,
        TimeoutOperation | (TimeoutPeriod << FDCAN_TOCC_TOP_Pos));
}

/**
  * @brief  Enable timeout counter.
  * @rmtoll TOCC         ETOC          LL_FDCAN_EnableTimeoutCounter
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableTimeoutCounter(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->TOCC, FDCAN_TOCC_ETOC);
}

/**
  * @brief  Disable timeout counter.
  * @rmtoll TOCC         ETOC          LL_FDCAN_DisableTimeoutCounter
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableTimeoutCounter(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->TOCC, FDCAN_TOCC_ETOC);
}

/**
  * @brief  Get timeout counter value.
  * @rmtoll TOCV         TOC           LL_FDCAN_GetTimeoutCounter
  * @param  FDCANx FDCAN Instance
  * @retval Timeout counter value.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTimeoutCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->TOCV, FDCAN_TOCV_TOC));
}

/**
  * @brief  Reset timeout counter value.
  * @rmtoll TOCV         TOC           LL_FDCAN_ResetTimeoutCounter
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ResetTimeoutCounter(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_REG(FDCANx->TOCV);
}

/**
  * @brief  Configure transmitter delay compensation.
  * @rmtoll TDCR         TDCF          LL_FDCAN_ConfigTxDelayCompensation\n
  *         TDCR         TDCO          LL_FDCAN_ConfigTxDelayCompensation
  * @param  FDCANx FDCAN Instance
  * @param  TdcOffset Transmitter delay compensation offset from 0x00 to 0x7F.
  * @param  TdcFilter Transmitter delay compensation filter from 0x00 to 0x7F.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ConfigTxDelayCompensation(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t TdcOffset,
    uint32_t TdcFilter) {
    WRITE_REG(
        FDCANx->TDCR, (TdcFilter << FDCAN_TDCR_TDCF_Pos) | (TdcOffset << FDCAN_TDCR_TDCO_Pos));
}

/**
  * @brief  Enable transmitter delay compensation.
  * @rmtoll DBTP         TDC           LL_FDCAN_EnableTxDelayCompensation
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableTxDelayCompensation(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->DBTP, FDCAN_DBTP_TDC);
}

/**
  * @brief  Disable transmitter delay compensation.
  * @rmtoll DBTP         TDC           LL_FDCAN_DisableTxDelayCompensation
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableTxDelayCompensation(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->DBTP, FDCAN_DBTP_TDC);
}

/**
  * @brief  Enable ISO 11898-1 protocol mode.
  * @rmtoll CCCR         NISO          LL_FDCAN_EnableISOMode
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableISOMode(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_NISO);
}

/**
  * @brief  Disable ISO 11898-1 protocol mode.
  * @rmtoll CCCR         NISO          LL_FDCAN_DisableISOMode
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableISOMode(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_NISO);
}

/**
  * @brief  Enable edge filtering during bus integration.
  * @rmtoll CCCR         EFBI          LL_FDCAN_EnableEdgeFiltering
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableEdgeFiltering(FDCAN_GlobalTypeDef* FDCANx) {
    SET_BIT(FDCANx->CCCR, FDCAN_CCCR_EFBI);
}

/**
  * @brief  Disable edge filtering during bus integration.
  * @rmtoll CCCR         EFBI          LL_FDCAN_DisableEdgeFiltering
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableEdgeFiltering(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_EFBI);
}

/**
  * @}
  */

/** @defgroup FDCAN_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Check if one or several flags are active.
  * @param  FDCANx FDCAN Instance
  * @param  Flags This parameter can be a combination of @ref FDCAN_LL_EC_GET_FLAG
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FDCAN_IsActiveFlag(const FDCAN_GlobalTypeDef* FDCANx, uint32_t Flags) {
    return ((READ_BIT(FDCANx->IR, Flags) == Flags) ? 1UL : 0UL);
}

/**
  * @brief  Clear one or several flags.
  * @param  FDCANx FDCAN Instance
  * @param  Flags This parameter can be a combination of @ref FDCAN_LL_EC_GET_FLAG
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ClearFlag(FDCAN_GlobalTypeDef* FDCANx, uint32_t Flags) {
    WRITE_REG(FDCANx->IR, Flags);
}

/**
  * @}
  */

/** @defgroup FDCAN_LL_EF_IT_Management IT Management
  * @{
  */

