STMicroelectronics/stm32u5xx-hal-driver/Inc/stm32u5xx_ll_fdcan.h
/**
  * @brief  Enable one or several interrupts.
  * @param  FDCANx FDCAN Instance
  * @param  Interrupts This parameter can be a combination of @ref FDCAN_LL_EC_IT
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableIT(FDCAN_GlobalTypeDef* FDCANx, uint32_t Interrupts) {
    SET_BIT(FDCANx->IE, Interrupts);
}

/**
  * @brief  Disable one or several interrupts.
  * @param  FDCANx FDCAN Instance
  * @param  Interrupts This parameter can be a combination of @ref FDCAN_LL_EC_IT
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableIT(FDCAN_GlobalTypeDef* FDCANx, uint32_t Interrupts) {
    CLEAR_BIT(FDCANx->IE, Interrupts);
}

/**
  * @brief  Check if one or several interrupt sources are enabled.
  * @param  FDCANx FDCAN Instance
  * @param  Interrupts This parameter can be a combination of @ref FDCAN_LL_EC_IT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t
    LL_FDCAN_IsEnabledIT(const FDCAN_GlobalTypeDef* FDCANx, uint32_t Interrupts) {
    return ((READ_BIT(FDCANx->IE, Interrupts) == Interrupts) ? 1UL : 0UL);
}

/**
  * @brief  Assign interrupt groups to interrupt line 0 or 1.
  * @param  FDCANx FDCAN Instance
  * @param  ITGroups This parameter can be a combination of @ref FDCAN_LL_EC_IT_GROUP
  * @param  InterruptLine This parameter can be a value of @ref FDCAN_LL_EC_INTERRUPT_LINE
  * @retval None
  */
__STATIC_INLINE void
    LL_FDCAN_SetITLine(FDCAN_GlobalTypeDef* FDCANx, uint32_t ITGroups, uint32_t InterruptLine) {
    if(InterruptLine == LL_FDCAN_INTERRUPT_LINE1) {
        SET_BIT(FDCANx->ILS, ITGroups);
    } else {
        CLEAR_BIT(FDCANx->ILS, ITGroups);
    }
}

/**
  * @brief  Enable interrupt line.
  * @param  FDCANx FDCAN Instance
  * @param  InterruptLine This parameter can be a value of @ref FDCAN_LL_EC_INTERRUPT_LINE
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_EnableITLine(FDCAN_GlobalTypeDef* FDCANx, uint32_t InterruptLine) {
    SET_BIT(FDCANx->ILE, InterruptLine);
}

/**
  * @brief  Disable interrupt line.
  * @param  FDCANx FDCAN Instance
  * @param  InterruptLine This parameter can be a value of @ref FDCAN_LL_EC_INTERRUPT_LINE
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_DisableITLine(FDCAN_GlobalTypeDef* FDCANx, uint32_t InterruptLine) {
    CLEAR_BIT(FDCANx->ILE, InterruptLine);
}

/**
  * @}
  */

/** @defgroup FDCAN_LL_EF_FIFO_Management FIFO Management
  * @{
  */

/**
  * @brief  Get Rx FIFO fill level.
  * @param  FDCANx FDCAN Instance
  * @param  RxFifo This parameter can be a value of @ref FDCAN_LL_EC_RX_FIFO
  * @retval Rx FIFO fill level.
  */
__STATIC_INLINE uint32_t
    LL_FDCAN_GetRxFifoFillLevel(const FDCAN_GlobalTypeDef* FDCANx, uint32_t RxFifo) {
    return (RxFifo == LL_FDCAN_RX_FIFO0) ? READ_BIT(FDCANx->RXF0S, FDCAN_RXF0S_F0FL) :
                                           READ_BIT(FDCANx->RXF1S, FDCAN_RXF1S_F1FL);
}

/**
  * @brief  Get Tx FIFO/Queue free level.
  * @param  FDCANx FDCAN Instance
  * @retval Tx FIFO/Queue free level.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTxFifoFreeLevel(const FDCAN_GlobalTypeDef* FDCANx) {
    return READ_BIT(FDCANx->TXFQS, FDCAN_TXFQS_TFFL);
}

/**
  * @brief  Check if Tx FIFO/Queue is full.
  * @param  FDCANx FDCAN Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FDCAN_IsActiveFlag_TxFifoFull(const FDCAN_GlobalTypeDef* FDCANx) {
    return ((READ_BIT(FDCANx->TXFQS, FDCAN_TXFQS_TFQF) == FDCAN_TXFQS_TFQF) ? 1UL : 0UL);
}

/**
  * @brief  Get Tx FIFO/Queue put index.
  * @param  FDCANx FDCAN Instance
  * @retval Tx FIFO/Queue put index.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTxFifoQueuePutIndex(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->TXFQS, FDCAN_TXFQS_TFQPI) >> FDCAN_TXFQS_TFQPI_Pos);
}

/**
  * @brief  Add Tx request.
  * @param  FDCANx FDCAN Instance
  * @param  BufferIndex Tx buffer bit index.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_AddTxRequest(FDCAN_GlobalTypeDef* FDCANx, uint32_t BufferIndex) {
    WRITE_REG(FDCANx->TXBAR, BufferIndex);
}

/**
  * @brief  Add Tx cancellation request.
  * @param  FDCANx FDCAN Instance
  * @param  BufferIndexes Tx buffer bit indexes.
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_AbortTxRequest(FDCAN_GlobalTypeDef* FDCANx, uint32_t BufferIndexes) {
    WRITE_REG(FDCANx->TXBCR, BufferIndexes);
}

/**
  * @brief  Check if a transmission request is pending on selected Tx buffer indexes.
  * @param  FDCANx FDCAN Instance
  * @param  BufferIndexes Tx buffer bit indexes.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t
    LL_FDCAN_IsTxBufferMessagePending(const FDCAN_GlobalTypeDef* FDCANx, uint32_t BufferIndexes) {
    return ((READ_BIT(FDCANx->TXBRP, BufferIndexes) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Check if Restricted Operation Mode is active.
  * @param  FDCANx FDCAN Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FDCAN_IsRestrictedOperationMode(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->CCCR, FDCAN_CCCR_ASM) >> FDCAN_CCCR_ASM_Pos);
}

/**
  * @brief  Exit Restricted Operation Mode.
  * @param  FDCANx FDCAN Instance
  * @retval None
  */
__STATIC_INLINE void LL_FDCAN_ExitRestrictedOperationMode(FDCAN_GlobalTypeDef* FDCANx) {
    CLEAR_BIT(FDCANx->CCCR, FDCAN_CCCR_ASM);
}

/**
  * @}
  */

/** @defgroup FDCAN_LL_EF_Status Status Management
  * @{
  */

/**
  * @brief  Get high priority message storage indicator.
  * @param  FDCANx FDCAN Instance
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_HP_MESSAGE_STATUS
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetHighPriorityMessageStorage(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->HPMS, FDCAN_HPMS_MSI));
}

/**
  * @brief  Get high priority message filter index.
  * @param  FDCANx FDCAN Instance
  * @retval Filter index.
  */
__STATIC_INLINE uint32_t
    LL_FDCAN_GetHighPriorityMessageFilterIndex(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->HPMS, FDCAN_HPMS_FIDX) >> FDCAN_HPMS_FIDX_Pos);
}

/**
  * @brief  Get high priority message index.
  * @param  FDCANx FDCAN Instance
  * @retval Message index.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetHighPriorityMessageIndex(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->HPMS, FDCAN_HPMS_BIDX));
}

/**
  * @brief  Get last error code.
  * @param  FDCANx FDCAN Instance
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_PROTOCOL_STATUS
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetLastErrorCode(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->PSR, FDCAN_PSR_LEC));
}

/**
  * @brief  Get data phase last error code.
  * @param  FDCANx FDCAN Instance
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_PROTOCOL_STATUS
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetDataLastErrorCode(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->PSR, FDCAN_PSR_DLEC) >> FDCAN_PSR_DLEC_Pos);
}

/**
  * @brief  Get communication activity.
  * @param  FDCANx FDCAN Instance
  * @retval Returned value can be a value of @ref FDCAN_LL_EC_PROTOCOL_STATUS
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetActivity(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->PSR, FDCAN_PSR_ACT));
}

/**
  * @brief  Get transmitter delay compensation value.
  * @param  FDCANx FDCAN Instance
  * @retval TDC value.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTxDelayCompensationValue(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->PSR, FDCAN_PSR_TDCV) >> FDCAN_PSR_TDCV_Pos);
}

/**
  * @brief  Get Tx error counter.
  * @param  FDCANx FDCAN Instance
  * @retval Tx error counter.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetTxErrorCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->ECR, FDCAN_ECR_TEC) >> FDCAN_ECR_TEC_Pos);
}

/**
  * @brief  Get Rx error counter.
  * @param  FDCANx FDCAN Instance
  * @retval Rx error counter.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetRxErrorCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->ECR, FDCAN_ECR_REC) >> FDCAN_ECR_REC_Pos);
}

/**
  * @brief  Get error logging counter.
  * @param  FDCANx FDCAN Instance
  * @retval Error logging counter.
  */
__STATIC_INLINE uint32_t LL_FDCAN_GetErrorLoggingCounter(const FDCAN_GlobalTypeDef* FDCANx) {
    return (uint32_t)(READ_BIT(FDCANx->ECR, FDCAN_ECR_CEL) >> FDCAN_ECR_CEL_Pos);
}

/**
  * @}
  */

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup FDCAN_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_FDCAN_DeInit(const FDCAN_GlobalTypeDef* FDCANx);
ErrorStatus LL_FDCAN_Init(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_InitTypeDef* FDCAN_InitStruct,
    LL_FDCAN_MessageRAMTypeDef* MessageRAM);
void LL_FDCAN_StructInit(LL_FDCAN_InitTypeDef* FDCAN_InitStruct);
void LL_FDCAN_MessageRAMStructInit(LL_FDCAN_MessageRAMTypeDef* MessageRAM);
/**
  * @}
  */

/** @defgroup FDCAN_LL_EF_Message_RAM Message RAM functions
  * @{
  */
void LL_FDCAN_ConfigMessageRAM(
    FDCAN_GlobalTypeDef* FDCANx,
    uint32_t StdFiltersNbr,
    uint32_t ExtFiltersNbr,
    LL_FDCAN_MessageRAMTypeDef* MessageRAM);
void LL_FDCAN_FlushMessageRAM(void);
ErrorStatus LL_FDCAN_ConfigFilter(
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_FilterTypeDef* FilterConfig);
ErrorStatus LL_FDCAN_AddMessageToTxFifoQ(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    const LL_FDCAN_TxHeaderTypeDef* TxHeader,
    const uint8_t* TxData,
    uint32_t* TxBufferIndex);
ErrorStatus LL_FDCAN_GetRxMessage(
    FDCAN_GlobalTypeDef* FDCANx,
    const LL_FDCAN_MessageRAMTypeDef* MessageRAM,
    uint32_t RxFifo,
    LL_FDCAN_RxHeaderTypeDef* RxHeader,
    uint8_t* RxData);
uint32_t LL_FDCAN_DLCToBytes(uint32_t DataLength);
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(FDCAN1) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5xx_LL_FDCAN_H */
